// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time = +prompt ("введіть число від 0 до 59, щоб дізнатися яка чверть години");

if (time<=15){
    console.log('Перша чверть години');
    } else if(time<=30) {
    console.log('Друга чверть години');
} else if(time<=45) {
    console.log('третя чверть години');
} else if(time<=59) {
    console.log('Четверта чверть години');
} else {
    console.log('некоректний дані')
}


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = +prompt('Введіть число від 1 до 31, щоб дізнатися яка декада місяця!');
 if (day<=10) {
     console.log('Перша декада місяця');
 } else if (day <= 20) {
     console.log('Друга декада місяця');
 }  else if (day <= 31) {
     console.log('Третя декада місяця');
 }  else  {
     console.log('перевірте правильність вводу даних');
 }

//- У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test;
if (!test){
    console.log('Вірно');
} else {
    console.log('Неправильно');
}

//2-й варіант з тернаркою

let test1 = !!true ? 'Вірно' : 'Невірно';
console.log(test1);

//- Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = +prompt('Введіть 1 або 0 або -3');
if (a === 0) {
    console.log('Вірно');
} else {
    console.log('Невірно');
}


// Скласти розклад на тиждень за домопоги switch. Користувач вводить
// порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.


let dayWeek=+prompt('Введіть порядковий номер дня тижня, щоб побачити ваші плани');
switch (dayWeek) {
    case 1:
        console.log('Вивчити: і виконати домашнє завдання по JS.Тема: умовне розгалуження,умовні оператори');
        break;
    case 2:
        console.log('Підготувати урок з англійської мови. Переказувати текст.');
        break;
    case 3:
        console.log('Можеш відпочити, але краще не треба.Багато роботи!');
        break;
    case 4:
        console.log('вчися, вчися і ще раз вчися');
        break;
    case 5:
        console.log('Можеш кімарнути,але не точно. Сон для слабаков! Вчися далі');
        break;
    case 6:
        console.log('No pain no gain');
        break;
    case 7:
        console.log('ти й так знаєш що робити!');
        break;
    default:
        console.log('немає таких значень.Поспи і спробуй ще раз');
}

// Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.


// Рік є високосним, якщо виконуються наступні умови:
// Рік кратний 4, а не кратному 100
// Рік кратний 400 .



let year=+prompt('Введіть рік щоб дізнатися чи він високосний!');

if ((year % 4 === 0) && (year % 100 !==0) || (year % 400===0)) {
    console.log(year +' Рік високосний')
} else {
    console.log('Рік невисокосний');
}



//- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let question = prompt('Яка «офіційна» назва JavaScript?');
if (question === 'ECMAScript') {
    console.log('«Правильно!»');
} else {
    console.log('«Не знаєте? ECMAScript!');
}



