
// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.






//- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let numberFlat=+prompt('Щоб дізнатися у якому пізїзді квартира, вкажіть її номер');
if(numberFlat<=20) {
    console.log ('Ваша квартира знаходиться у першому піз"їзді')
} else if (numberFlat<=48) {
    console.log ('Ваша квартира знаходиться у другому піз"їзді')
} else if (numberFlat<=90) {
    console.log('Ваша квартира знаходиться у третьому піз"їзді')
} else {
    console.log('Такої квартири у будинку немає')
}

//- Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number;
if(number===10) {
    console.log('ВІРНО')
} else if (number!=10) {
    console.log('НЕВІРНО')
} else {
    console.log('else')
}


//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else


let x;
if (typeof x === 'number') {
    console.log('1' + ' цей тип даних число')
} else if (typeof x==='string') {
    console.log('2' +  ' цей тип даних стрінга')
} else if (typeof x==='boolean') {
    console.log('3' +  ' цей тип даних булеві')
}  else if (typeof x==='object') {
    console.log('4' + ' цей тип даних обєкт')
} else {
    console.log('else')
}



//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let degrees=8;
if (degrees>=10 && degrees<=22) {
    console.log('ми йдемо ВЧИТИСЯ')
} else {
    console.log('сидимо вдома і вчимося ОНЛАЙН')
}


//За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
// І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д )
//     і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ..

let game = +prompt('введіть число від 1до 5. Нехай щастить')
if (game===1) {
    console.log('Ти виграв Авто.Вітаємо')
} else  if (game===2) {
    console.log('Ти виграв Мото. Вітаємо')
} else if (game===3) {
    console.log('Ти виграв Телефон.ура!')
} else if (game === 4) {
    console.log('Ти виграв ровер.Юхуу')
} else if (game===5) {
    console.log('Да ти Щасливчик.Ти виграв курс у Октен school! Щасти-)')
} else {
    console.log('Число невірне. Спробуй ще!')
}